In [1]:
import pandas as pd
df=pd.read_csv("C:/Datasets/titanic.csv")

In [2]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [3]:
y=df["Survived"] #survived-1 died-0

In [4]:
x=df.drop("Survived",axis =1)

In [5]:
x.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [6]:
x=x.drop(["PassengerId","Name","Ticket","Embarked"],axis =1)

In [7]:
x.head()

   Pclass     Sex   Age  SibSp  Parch     Fare Cabin
0       3    male  22.0      1      0   7.2500   NaN
1       1  female  38.0      1      0  71.2833   C85
2       3  female  26.0      0      0   7.9250   NaN
3       1  female  35.0      1      0  53.1000  C123
4       3    male  35.0      0      0   8.0500   NaN

In [8]:
x.isna().sum()

Pclass      0
Sex         0
Age       177
SibSp       0
Parch       0
Fare        0
Cabin     687
dtype: int64

In [9]:
x.shape

(891, 7)

In [10]:
#drop column
x=x.drop(["Cabin"],axis =1)

In [11]:
#fill with mean
x["Age"]=x["Age"].fillna(x["Age"].mean())

In [12]:
x.isna().sum()

Pclass    0
Sex       0
Age       0
SibSp     0
Parch     0
Fare      0
dtype: int64

In [13]:
y.isna().sum()

0

In [14]:
x.dtypes

Pclass      int64
Sex        object
Age       float64
SibSp       int64
Parch       int64
Fare      float64
dtype: object

In [15]:
x=pd.get_dummies(x,columns=["Sex"],drop_first=True)

In [16]:
x.head()

   Pclass   Age  SibSp  Parch     Fare  Sex_male
0       3  22.0      1      0   7.2500         1
1       1  38.0      1      0  71.2833         0
2       3  26.0      0      0   7.9250         0
3       1  35.0      1      0  53.1000         0
4       3  35.0      0      0   8.0500         1

In [17]:
type(x)

pandas.core.frame.DataFrame

In [18]:
x.shape

(891, 6)

In [19]:
from sklearn.model_selection import train_test_split

In [20]:
x_train,x_test,y_train,y_test = train_test_split(x,y,test_size=0.3, random_state=42,stratify=y)

In [21]:
x.describe()

           Pclass         Age       SibSp       Parch        Fare    Sex_male
count  891.000000  891.000000  891.000000  891.000000  891.000000  891.000000
mean     2.308642   29.699118    0.523008    0.381594   32.204208    0.647587
std      0.836071   13.002015    1.102743    0.806057   49.693429    0.477990
min      1.000000    0.420000    0.000000    0.000000    0.000000    0.000000
25%      2.000000   22.000000    0.000000    0.000000    7.910400    0.000000
50%      3.000000   29.699118    0.000000    0.000000   14.454200    1.000000
75%      3.000000   35.000000    1.000000    0.000000   31.000000    1.000000
max      3.000000   80.000000    8.000000    6.000000  512.329200    1.000000

In [22]:
from sklearn.preprocessing import MinMaxScaler

In [23]:
scaler=MinMaxScaler()

In [24]:
x_train= scaler.fit_transform(x_train)
x_test= scaler.transform(x_test)

In [25]:
from sklearn.linear_model import LogisticRegression

In [26]:
model=LogisticRegression()

In [27]:
model.fit(x_train,y_train)

LogisticRegression()

In [28]:
model.score(x_test,y_test)

0.7873134328358209

In [29]:
#prediction
data=pd.DataFrame({"First":[7],"Second":[1],"Third":["Alicia"],"Fourth":["Female"],"Fifth":[22],"Sixth":[2],"Seventh":[3],"Eighth":["AC 34343"],"Ninth":[71],"Tenth":["c324"],"Eleventh":["S"]})

In [30]:
data

,First,Second,Third,Fourth,Fifth,Sixth,Seventh,Eighth,Ninth,Tenth,Eleventh
0,7,1,Alicia,Female,22,2,3,AC 34343,71,c324,S

In [31]:
data=data.drop(["First","Third","Eighth","Tenth","Eleventh"],axis=1)

In [32]:
data

   Second  Fourth  Fifth  Sixth  Seventh  Ninth
0       1  Female     22      2        3     71

In [33]:
#categorical encoding
data=pd.get_dummies(data,columns=["Fourth"])

In [34]:
data

   Second  Fifth  Sixth  Seventh  Ninth  Fourth_Female
0       1     22      2        3     71              1

In [35]:
data.loc[0,"Fourth_Female"]=0

In [36]:
data=scaler.transform(data)

In [37]:
model.predict(data)

array([1], dtype=int64)